# Energy Analysis Zone Cooling Set Point Property

Source: https://www.revitapidocs.com/2026/4e4b75d4-4c17-32c5-d7fd-8c1e03e6ed67.htm

---

| Energy Analysis Zone Cooling Set Point Property |
| --- |

The cooling temperature set point in unit Kelvin (K).
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CoolingSetPoint { get; }
```

```
Public ReadOnly Property CoolingSetPoint As Double
	Get
```

```
public:
property double CoolingSetPoint {
	double get ();
}
```

```
member CoolingSetPoint : float with get
```

#### Property Value

Double See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace